@extends('frontend.layouts.main')
@section('main-content')

<!-- Gallery Banner Section -->
<section class="history-banner mb-4">
    <div class="container-custom position-relative">
        <img src="{{ asset('assets/img/Gurukul/half.jpg') }}" alt="इतिहास Section" class="img-fluid rounded w-100">
        <div class="overlay-text"> दान</div>
    </div>
</section>

<!-- भविष्य योजना Section -->
<section style="background-color: #e9a8b0;" class="py-5 text-dark">

    <div class="container">
        <h2 class="mb-4">भविष्य योजना</h2>
        <p>वर्तमानमा यस गुरुकुलमा आधारित तहदेखि आचार्यतहसम्मको औपचारिक अध्ययन भइहेको छ। माध्यमिक तहसम्म नेपाल सरकारद्वारा स्वीकृत गुरुकुलीय पाठ्यक्रमका सम्पूर्ण विषयको अध्ययन एवं अध्यापन गराइन्छ। विद्वान् तहमा नेपाल संस्कृत विश्वविद्यालयद्वारा निर्धारित पाठ्यक्रममा आधारित रहेर संस्कृत एवं नेपाली विषयको अध्ययन भइहेको छ। हालसम्म स्नातकोत्तर तहका लागि शास्त्रीय, व्याकरण र साहित्य विषय अध्यापनको अनुमति प्राप्त भएकोमा निकट भविष्यमा मीमांसा, न्याय, ज्योतिष, ज्योतिष, योग, आयुर्वेद लगायतका शास्त्रीय विषयको अध्ययनको व्यवस्था गर्ने योजना छ। साथै हालसम्म २५० जना छात्रछात्रा आवासीय शिक्षामा आबद्ध भइ अध्ययन गरिरहेका छन्। शिक्षा तथा अध्ययन अध्यापनको औपचारिक रूपमा आवासीय क्षमताको अभिवृद्धि गर्दै गुरुकुललाई विराट स्वरूपमा सञ्चालन गर्नु आवश्यक देखिएको छ। यसका लागि विशेषतः पूर्वाधार वृद्धिको आवश्यकता छ।</p>
        
        <p>महत्वपूर्ण ग्रन्थहरूको संग्रह, संरक्षण, अनुबाद एवं प्रकाशनका लागि सुविधासम्पन्न अनुसन्धान केन्द्र (RRC) स्थापना गर्ने कार्य अघि बढाइएको छ। देशका विभिन्न स्थानमा गुरुकुल शाखा-शाखा स्थापनाद्वारा गुरुकुलमा प्रचलित शिक्षा पद्दतिको प्रचार–प्रसार गर्ने तथा गुरुकुललाई विस्तार गर्दै राष्ट्र संस्कार र संस्कृत शिक्षाको प्रवर्द्धन गुरुकुलले नेतृत्वदायी भूमिका निर्वाह गर्ने देखिन्छ।</p>

        <h5 class="mt-4">निकट भविष्यका निम्न निर्धारित योजना:</h5>
        <ul>
            <li>संस्कृत अध्ययनको अधिकारिक अध्ययनकेन्द्रका रूपमा गुरुकुललाई प्रवर्द्धन गर्ने</li>
            <li>स्नातक र स्नातकोत्तर तहमा शास्त्रीय विषयहरूको अध्ययन विस्तार गर्ने</li>
            <li>आवासीय अध्ययन तथा विद्यार्थी संख्याको वृद्धि गर्ने</li>
            <li>शास्त्रीय संस्कृत ग्रन्थहरूको संरक्षण, अनुवाद एवं प्रकाशन गर्ने</li>
            <li>अनुसन्धानमूलक अध्ययन एवं योग, आयुर्वेद इत्यादि विषयको अध्ययन गर्ने गराउने</li>
            <li>अनुसन्धानमूलक ग्रन्थ तथा पत्रिकाको प्रकाशनलाई निरन्तरता दिने</li>
        </ul>
    </div>
</section>

@endsection
